back/dian_policy.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="WcfDianCustomerServices" targetNamespace="http://wcf.dian.colombia" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:i0="http://tempuri.org/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://wcf.dian.colombia" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><wsdl:import namespace="http://tempuri.org/" location="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?wsdl=wsdl0"/><wsdl:types><xsd:schema targetNamespace="http://wcf.dian.colombia/Imports"><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd0" namespace="http://wcf.dian.colombia"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd1" namespace="http://schemas.microsoft.com/2003/10/Serialization/"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd2" namespace="http://schemas.datacontract.org/2004/07/ExchangeEmailResponse"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd3" namespace="http://schemas.datacontract.org/2004/07/DianResponse"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd4" namespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd5" namespace="http://schemas.datacontract.org/2004/07/UploadDocumentResponse"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd6" namespace="http://schemas.datacontract.org/2004/07/XmlParamsResponseTrackId"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd7" namespace="http://schemas.datacontract.org/2004/07/NumberRangeResponseList"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd8" namespace="http://schemas.datacontract.org/2004/07/NumberRangeResponse"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd9" namespace="http://schemas.datacontract.org/2004/07/EventResponse"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd10" namespace="http://schemas.datacontract.org/2004/07/Gosocket.Dian.Services.Utils.Common"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd11" namespace="http://schemas.datacontract.org/2004/07/DocumentInfoResponse"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd12" namespace="http://schemas.datacontract.org/2004/07/Documento"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd13" namespace="http://schemas.datacontract.org/2004/07/Nota"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd14" namespace="http://schemas.datacontract.org/2004/07/ConceptoCorreccion"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd15" namespace="http://schemas.datacontract.org/2004/07/Entidad"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd16" namespace="http://schemas.datacontract.org/2004/07/LegitimoTenedor"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd17" namespace="http://schemas.datacontract.org/2004/07/NumeroDocumento"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd18" namespace="http://schemas.datacontract.org/2004/07/TotalEImpuestos"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd19" namespace="http://schemas.datacontract.org/2004/07/ValidacionDoc"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd20" namespace="http://schemas.datacontract.org/2004/07/Evento"/><xsd:import schemaLocation="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc?xsd=xsd21" namespace="http://schemas.datacontract.org/2004/07/ReferenciaDocumento"/></xsd:schema></wsdl:types><wsdl:message name="IWcfDianCustomerServices_GetExchangeEmails_InputMessage"><wsdl:part name="parameters" element="tns:GetExchangeEmails"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_GetExchangeEmails_OutputMessage"><wsdl:part name="parameters" element="tns:GetExchangeEmailsResponse"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_GetStatus_InputMessage"><wsdl:part name="parameters" element="tns:GetStatus"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_GetStatus_OutputMessage"><wsdl:part name="parameters" element="tns:GetStatusResponse"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_GetStatusZip_InputMessage"><wsdl:part name="parameters" element="tns:GetStatusZip"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_GetStatusZip_OutputMessage"><wsdl:part name="parameters" element="tns:GetStatusZipResponse"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_GetStatusEvent_InputMessage"><wsdl:part name="parameters" element="tns:GetStatusEvent"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_GetStatusEvent_OutputMessage"><wsdl:part name="parameters" element="tns:GetStatusEventResponse"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_SendBillAsync_InputMessage"><wsdl:part name="parameters" element="tns:SendBillAsync"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_SendBillAsync_OutputMessage"><wsdl:part name="parameters" element="tns:SendBillAsyncResponse"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_SendTestSetAsync_InputMessage"><wsdl:part name="parameters" element="tns:SendTestSetAsync"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_SendTestSetAsync_OutputMessage"><wsdl:part name="parameters" element="tns:SendTestSetAsyncResponse"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_SendBillSync_InputMessage"><wsdl:part name="parameters" element="tns:SendBillSync"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_SendBillSync_OutputMessage"><wsdl:part name="parameters" element="tns:SendBillSyncResponse"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_SendBillAttachmentAsync_InputMessage"><wsdl:part name="parameters" element="tns:SendBillAttachmentAsync"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_SendBillAttachmentAsync_OutputMessage"><wsdl:part name="parameters" element="tns:SendBillAttachmentAsyncResponse"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_SendEventUpdateStatus_InputMessage"><wsdl:part name="parameters" element="tns:SendEventUpdateStatus"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_SendEventUpdateStatus_OutputMessage"><wsdl:part name="parameters" element="tns:SendEventUpdateStatusResponse"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_SendNominaSync_InputMessage"><wsdl:part name="parameters" element="tns:SendNominaSync"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_SendNominaSync_OutputMessage"><wsdl:part name="parameters" element="tns:SendNominaSyncResponse"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_GetNumberingRange_InputMessage"><wsdl:part name="parameters" element="tns:GetNumberingRange"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_GetNumberingRange_OutputMessage"><wsdl:part name="parameters" element="tns:GetNumberingRangeResponse"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_GetXmlByDocumentKey_InputMessage"><wsdl:part name="parameters" element="tns:GetXmlByDocumentKey"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_GetXmlByDocumentKey_OutputMessage"><wsdl:part name="parameters" element="tns:GetXmlByDocumentKeyResponse"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_GetReferenceNotes_InputMessage"><wsdl:part name="parameters" element="tns:GetReferenceNotes"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_GetReferenceNotes_OutputMessage"><wsdl:part name="parameters" element="tns:GetReferenceNotesResponse"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_GetAcquirer_InputMessage"><wsdl:part name="parameters" element="tns:GetAcquirer"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_GetAcquirer_OutputMessage"><wsdl:part name="parameters" element="tns:GetAcquirerResponse"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_GetDocumentInfo_InputMessage"><wsdl:part name="parameters" element="tns:GetDocumentInfo"/></wsdl:message><wsdl:message name="IWcfDianCustomerServices_GetDocumentInfo_OutputMessage"><wsdl:part name="parameters" element="tns:GetDocumentInfoResponse"/></wsdl:message><wsdl:portType name="IWcfDianCustomerServices"><wsdl:operation name="GetExchangeEmails"><wsdl:input wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/GetExchangeEmails" message="tns:IWcfDianCustomerServices_GetExchangeEmails_InputMessage"/><wsdl:output wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/GetExchangeEmailsResponse" message="tns:IWcfDianCustomerServices_GetExchangeEmails_OutputMessage"/></wsdl:operation><wsdl:operation name="GetStatus"><wsdl:input wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/GetStatus" message="tns:IWcfDianCustomerServices_GetStatus_InputMessage"/><wsdl:output wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/GetStatusResponse" message="tns:IWcfDianCustomerServices_GetStatus_OutputMessage"/></wsdl:operation><wsdl:operation name="GetStatusZip"><wsdl:input wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/GetStatusZip" message="tns:IWcfDianCustomerServices_GetStatusZip_InputMessage"/><wsdl:output wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/GetStatusZipResponse" message="tns:IWcfDianCustomerServices_GetStatusZip_OutputMessage"/></wsdl:operation><wsdl:operation name="GetStatusEvent"><wsdl:input wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/GetStatusEvent" message="tns:IWcfDianCustomerServices_GetStatusEvent_InputMessage"/><wsdl:output wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/GetStatusEventResponse" message="tns:IWcfDianCustomerServices_GetStatusEvent_OutputMessage"/></wsdl:operation><wsdl:operation name="SendBillAsync"><wsdl:input wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/SendBillAsync" message="tns:IWcfDianCustomerServices_SendBillAsync_InputMessage"/><wsdl:output wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/SendBillAsyncResponse" message="tns:IWcfDianCustomerServices_SendBillAsync_OutputMessage"/></wsdl:operation><wsdl:operation name="SendTestSetAsync"><wsdl:input wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/SendTestSetAsync" message="tns:IWcfDianCustomerServices_SendTestSetAsync_InputMessage"/><wsdl:output wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/SendTestSetAsyncResponse" message="tns:IWcfDianCustomerServices_SendTestSetAsync_OutputMessage"/></wsdl:operation><wsdl:operation name="SendBillSync"><wsdl:input wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/SendBillSync" message="tns:IWcfDianCustomerServices_SendBillSync_InputMessage"/><wsdl:output wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/SendBillSyncResponse" message="tns:IWcfDianCustomerServices_SendBillSync_OutputMessage"/></wsdl:operation><wsdl:operation name="SendBillAttachmentAsync"><wsdl:input wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/SendBillAttachmentAsync" message="tns:IWcfDianCustomerServices_SendBillAttachmentAsync_InputMessage"/><wsdl:output wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/SendBillAttachmentAsyncResponse" message="tns:IWcfDianCustomerServices_SendBillAttachmentAsync_OutputMessage"/></wsdl:operation><wsdl:operation name="SendEventUpdateStatus"><wsdl:input wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/SendEventUpdateStatus" message="tns:IWcfDianCustomerServices_SendEventUpdateStatus_InputMessage"/><wsdl:output wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/SendEventUpdateStatusResponse" message="tns:IWcfDianCustomerServices_SendEventUpdateStatus_OutputMessage"/></wsdl:operation><wsdl:operation name="SendNominaSync"><wsdl:input wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/SendNominaSync" message="tns:IWcfDianCustomerServices_SendNominaSync_InputMessage"/><wsdl:output wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/SendNominaSyncResponse" message="tns:IWcfDianCustomerServices_SendNominaSync_OutputMessage"/></wsdl:operation><wsdl:operation name="GetNumberingRange"><wsdl:input wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/GetNumberingRange" message="tns:IWcfDianCustomerServices_GetNumberingRange_InputMessage"/><wsdl:output wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/GetNumberingRangeResponse" message="tns:IWcfDianCustomerServices_GetNumberingRange_OutputMessage"/></wsdl:operation><wsdl:operation name="GetXmlByDocumentKey"><wsdl:input wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/GetXmlByDocumentKey" message="tns:IWcfDianCustomerServices_GetXmlByDocumentKey_InputMessage"/><wsdl:output wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/GetXmlByDocumentKeyResponse" message="tns:IWcfDianCustomerServices_GetXmlByDocumentKey_OutputMessage"/></wsdl:operation><wsdl:operation name="GetReferenceNotes"><wsdl:input wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/GetReferenceNotes" message="tns:IWcfDianCustomerServices_GetReferenceNotes_InputMessage"/><wsdl:output wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/GetReferenceNotesResponse" message="tns:IWcfDianCustomerServices_GetReferenceNotes_OutputMessage"/></wsdl:operation><wsdl:operation name="GetAcquirer"><wsdl:input wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/GetAcquirer" message="tns:IWcfDianCustomerServices_GetAcquirer_InputMessage"/><wsdl:output wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/GetAcquirerResponse" message="tns:IWcfDianCustomerServices_GetAcquirer_OutputMessage"/></wsdl:operation><wsdl:operation name="GetDocumentInfo"><wsdl:input wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/GetDocumentInfo" message="tns:IWcfDianCustomerServices_GetDocumentInfo_InputMessage"/><wsdl:output wsaw:Action="http://wcf.dian.colombia/IWcfDianCustomerServices/GetDocumentInfoResponse" message="tns:IWcfDianCustomerServices_GetDocumentInfo_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:service name="WcfDianCustomerServices"><wsdl:port name="WSHttpBinding_IWcfDianCustomerServices" binding="i0:WSHttpBinding_IWcfDianCustomerServices"><soap12:address location="https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc"/><wsa10:EndpointReference><wsa10:Address>https://vpfe-hab.dian.gov.co/WcfDianCustomerServices.svc</wsa10:Address></wsa10:EndpointReference></wsdl:port></wsdl:service></wsdl:definitions>