resources/templates/soap/GetStatusZip.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wcf="http://wcf.dian.colombia">
    <soap:Body>
        <wcf:GetStatusZip>
            <!--Optional:-->
            <wcf:trackId></wcf:trackId>
        </wcf:GetStatusZip>
    </soap:Body>
</soap:Envelope>