resources/templates/soap/SendTestSetAsync.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wcf="http://wcf.dian.colombia">
    <soap:Body>
        <wcf:SendTestSetAsync>
            <!--Optional:-->
            <wcf:fileName></wcf:fileName>
            <!--Optional:-->
            <wcf:contentFile></wcf:contentFile>
            <!--Optional:-->
            <wcf:testSetId></wcf:testSetId>
        </wcf:SendTestSetAsync>
    </soap:Body>
</soap:Envelope>