resources/templates/soap/SendBillAsync.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wcf="http://wcf.dian.colombia">
    <soap:Body>
        <wcf:SendBillAsync>
            <!--Optional:-->
            <wcf:fileName></wcf:fileName>
            <!--Optional:-->
            <wcf:contentFile></wcf:contentFile>
        </wcf:SendBillAsync>
    </soap:Body>
</soap:Envelope>