extra-addons/l10n_co_e_invoicing/templates/GetNumberingRange.xml

<soap:Envelope
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:wcf="http://wcf.dian.colombia">

    <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">

        <wsse:Security
            xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
            xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">

            <!-- Timestamp -->
            <wsu:Timestamp wsu:Id="TS-{{Id}}">
                <wsu:Created>{{Created}}</wsu:Created>
                <wsu:Expires>{{Expires}}</wsu:Expires>
            </wsu:Timestamp>

            <!-- Certificado X509 -->
            <wsse:BinarySecurityToken
                EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"
                ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"
                wsu:Id="X509-{{Id}}">
                {{BinarySecurityToken}}
            </wsse:BinarySecurityToken>

        </wsse:Security>

        <wsa:Action>
            http://wcf.dian.colombia/IWcfDianCustomerServices/GetNumberingRange
        </wsa:Action>

        <wsa:To
            xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
            wsu:Id="id-{{Id}}">
            {{To}}
        </wsa:To>

    </soap:Header>

    <soap:Body>

        <wcf:GetNumberingRange>
            <!-- 🔥 NIT SIN DV -->
            <!-- <wcf:accountCode>900973659</wcf:accountCode>
            <wcf:accountCodeT>900973659</wcf:accountCodeT> -->

            <wcf:accountCode>{{ accountCode }}</wcf:accountCode>

            <wcf:accountCodeT>{{ accountCodeT }}</wcf:accountCodeT>

            <!-- 🔥 SOFTWARE ID REGISTRADO EN DIAN -->
            <!-- <wcf:softwareCode>8548a9aa-9f4a-4101-9384-b9abce9b0b02</wcf:softwareCode> -->
            <wcf:softwareCode>{{ softwareCode }}</wcf:softwareCode>

        </wcf:GetNumberingRange>

    </soap:Body>

</soap:Envelope>
