resources/templates/soap/GetNumberingRange.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wcf="http://wcf.dian.colombia">
    <soap:Header/>
    <soap:Body>
        <wcf:GetNumberingRange>
            <wcf:accountCode></wcf:accountCode>
            <wcf:accountCodeT></wcf:accountCodeT>
            <wcf:softwareCode></wcf:softwareCode>
        </wcf:GetNumberingRange>
    </soap:Body>
</soap:Envelope>